Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PipeTransitionPreferenceTable Class Referencefinal
MEP Element Manager
The PipeTransitionPreferenceTable contains cross section and geometry related information for Pipe transitions. More...
#include <MEPPipeTransitionPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipeTransitionPreferenceTable:
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetBeginReferenceId (uint32_t index) const
Result< uint32_t >  | GetEndReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if both diameters and the transition length contains non-zero values, description is optional.
Result< bool >  | IsRowValidByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
A row is considered valid if both diameters and the transition length contains non-zero values, description is optional.
Result< double >  | GetBeginDiameter (uint32_t index) const
Result< double >  | GetBeginDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< double >  | GetEndDiameter (uint32_t index) const
Result< double >  | GetEndDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< double >  | GetLength (uint32_t index) const
Result< double >  | GetLengthByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (uint32_t beginReferenceId, uint32_t endReferenceId)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId)
Deletes a row from the table.
Result< void >  | SetBeginDiameter (uint32_t index, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetBeginDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetEndDiameter (uint32_t index, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetEndDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetLength (uint32_t index, double length)
Sets the length value of a table's row.
Result< void >  | SetLengthByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double length)
Sets the length value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, const GS::UniString &description)
Sets the description of a table's row.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipeTransitionPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a PipeTransitionPreferenceTable.
 Protected Member Functions
Modifier (PipeTransitionPreferenceTable &parent)
Constructs a Modifier with the given PipeTransitionPreferenceTable.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeTransitionPreferenceTable contains cross section and geometry related information for Pipe transitions.
Since
Archicad 29
The table uses the keys defined by the PipeReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& pipeTransitionTableId : pipeTransitionTableIds) {
 ACAPI::Result<PipeTransitionPreferenceTable> pipeTransitionTable = PipeTransitionPreferenceTable::Get (pipeTransitionTableId);
 if (pipeTransitionTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", pipeTransitionTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < pipeTransitionTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Begin ReferenceId", *pipeTransitionTable->GetBeginReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End ReferenceId", *pipeTransitionTable->GetEndReferenceId (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Begin Diameter", *pipeTransitionTable->GetBeginDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End Diameter", *pipeTransitionTable->GetEndDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Length", *pipeTransitionTable->GetLength (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *pipeTransitionTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*pipeTransitionTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification: take a look at DuctTransitionPreferenceTable
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::v1::PipeTransitionPreferenceTable::AddNewRow  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
)
Inserts a new row into the table.
Parameters
beginReferenceId | The begin referenceId of the new row. It must be a referenceId that is defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the new row. It must be a referenceId that is defined in the PipeReferenceSet.
If endReferenceId is larger than the beginReferenceId, the two values will be swapped before insertion.
Returns
Returns error if the pair of referenceIds is already present in the table, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::DeleteRow  |  ( |  uint32_t  |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByReferenceIds()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::DeleteRowByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
)
Deletes a row from the table.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::PipeTransitionPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PipeTransitionPreferenceTable > ACAPI::MEP::v1::PipeTransitionPreferenceTable::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a PipeTransitionPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested PipeTransitionPreferenceTable.
Returns
If the uniqueId belongs to a PipeTransitionPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetBeginDiameter()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetBeginDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginDiameterByReferenceIds()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetBeginDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetBeginReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin referenceId of the table's row.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetDescription  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByReferenceIds()
 Result< GS::UniString > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetDescriptionByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the description of the table's row.
◆ GetEndDiameter()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetEndDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndDiameterByReferenceIds()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetEndDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetEndReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end referenceId of the table's row.
◆ GetLength()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetLength  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetLengthByReferenceIds()
 Result< double > ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetLengthByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::v1::PipeTransitionPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::v1::PipeTransitionPreferenceTable::IsRowValid  |  ( |  uint32_t  |  index | ) |   const
A row is considered valid if both diameters and the transition length contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByReferenceIds()
 Result< bool > ACAPI::MEP::v1::PipeTransitionPreferenceTable::IsRowValidByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
A row is considered valid if both diameters and the transition length contains non-zero values, description is optional.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the validity state of the row.
◆ Modifier()
 ACAPI::MEP::v1::PipeTransitionPreferenceTable::Modifier  |  ( |  PipeTransitionPreferenceTable &  |  parent | )
protected
Constructs a Modifier with the given PipeTransitionPreferenceTable.
Parameters
parent | The given PipeTransitionPreferenceTable.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetBeginDiameter()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetBeginDiameter  |  ( |  uint32_t  |  index,
|  double  |  diameter
)
Sets the begin diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the end diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetBeginDiameterByReferenceIds()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetBeginDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  diameter
)
Sets the begin diameter value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
diameter | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the PipeReferenceSet, it will insert the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId is not in the PipeReferenceSet;
if the end diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetDescription  |  ( |  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByReferenceIds()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetDescriptionByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
description | The description to be set.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the PipeReferenceSet, it will insert the row.
Returns
Returns error if at least one referenceId is not in the PipeReferenceSet, otherwise nothing.
◆ SetEndDiameter()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetEndDiameter  |  ( |  uint32_t  |  index,
|  double  |  diameter
)
Sets the end diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the begin diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetEndDiameterByReferenceIds()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetEndDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  diameter
)
Sets the end diameter value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
diameter | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the PipeReferenceSet, it will insert the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId is not in the PipeReferenceSet;
if the begin diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetLength()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetLength  |  ( |  uint32_t  |  index,
|  double  |  length
)
Sets the length value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
length | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the begin diameter and end diameter are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetLengthByReferenceIds()
 Result< void > ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetLengthByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  length
)
Sets the length value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
length | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the PipeReferenceSet, it will insert the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId is not in the PipeReferenceSet;
if the begin diameter and end diameter are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetName()
 void ACAPI::MEP::v1::PipeTransitionPreferenceTable::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.